florianbaer/HSLU-MICRO/Tutorial_09_Timer_Compare_Template.zip_expanded/Tutorial_09_Timer_Compare_Template/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_JOYSTICK
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_JOYSTICK(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t RIGHT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 53)  */
    GPIO_PinInit(BOARD_JOYSTICK_RIGHT_GPIO, BOARD_JOYSTICK_RIGHT_PIN, &RIGHT_config);

    gpio_pin_config_t DOWN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 54)  */
    GPIO_PinInit(BOARD_JOYSTICK_DOWN_GPIO, BOARD_JOYSTICK_DOWN_PIN, &DOWN_config);

    gpio_pin_config_t UP_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 55)  */
    GPIO_PinInit(BOARD_JOYSTICK_UP_GPIO, BOARD_JOYSTICK_UP_PIN, &UP_config);

    gpio_pin_config_t PUSH_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 56)  */
    GPIO_PinInit(BOARD_JOYSTICK_PUSH_GPIO, BOARD_JOYSTICK_PUSH_PIN, &PUSH_config);

    gpio_pin_config_t LEFT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB9 (pin 57)  */
    GPIO_PinInit(BOARD_JOYSTICK_LEFT_GPIO, BOARD_JOYSTICK_LEFT_PIN, &LEFT_config);

    /* PORTB0 (pin 53) is configured as PTB0 */
    PORT_SetPinMux(BOARD_JOYSTICK_RIGHT_PORT, BOARD_JOYSTICK_RIGHT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB0 (pin 53): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_JOYSTICK_RIGHT_PORT, BOARD_JOYSTICK_RIGHT_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[0] = ((PORTB->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTB1 (pin 54) is configured as PTB1 */
    PORT_SetPinMux(BOARD_JOYSTICK_DOWN_PORT, BOARD_JOYSTICK_DOWN_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB1 (pin 54): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_JOYSTICK_DOWN_PORT, BOARD_JOYSTICK_DOWN_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[1] = ((PORTB->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTB2 (pin 55) is configured as PTB2 */
    PORT_SetPinMux(BOARD_JOYSTICK_UP_PORT, BOARD_JOYSTICK_UP_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB2 (pin 55): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_JOYSTICK_UP_PORT, BOARD_JOYSTICK_UP_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[2] = ((PORTB->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTB3 (pin 56) is configured as PTB3 */
    PORT_SetPinMux(BOARD_JOYSTICK_PUSH_PORT, BOARD_JOYSTICK_PUSH_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB3 (pin 56): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_JOYSTICK_PUSH_PORT, BOARD_JOYSTICK_PUSH_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[3] = ((PORTB->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTB9 (pin 57) is configured as PTB9 */
    PORT_SetPinMux(BOARD_JOYSTICK_LEFT_PORT, BOARD_JOYSTICK_LEFT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB9 (pin 57): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_JOYSTICK_LEFT_PORT, BOARD_JOYSTICK_LEFT_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[9] = ((PORTB->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_BL:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '58', peripheral: GPIOB, signal: 'GPIO, 10', pin_signal: ADC1_SE14/PTB10/SPI1_PCS0/LPUART0_RX/FB_AD19/FTM0_FLT1}
  - {pin_num: '59', peripheral: GPIOB, signal: 'GPIO, 11', pin_signal: ADC1_SE15/PTB11/SPI1_SCK/LPUART0_TX/FB_AD18/FTM0_FLT2}
  - {pin_num: '62', peripheral: GPIOB, signal: 'GPIO, 16', pin_signal: PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/EWM_IN}
  - {pin_num: '63', peripheral: GPIOB, signal: 'GPIO, 17', pin_signal: PTB17/SPI1_SIN/UART0_TX/FTM_CLKIN1/FB_AD16/EWM_OUT_b}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

